//Вывести на экран консоли число e с точностью до десятых.

//задали число e с типом данных double
double e = 2.7;

//Вывели результат на экран когнсоли
System.Console.WriteLine($"e = {e}");