//Вывести на экран число с точностью до сотых.

//Задаём любое число с типом данных double
double number = 2.12;

//Выводим результат в кконсоль
System.Console.WriteLine(number);