//Вывести на экран числа 50 и 10 одно под другим.

// Очень простой способ вывести числа программа составляет одну строку.
// System.Console.WriteLine($"{50},\n{10},\n");

// Возможен и другой способ на по длиннее.
int A = 50;
int B = 10;

System.Console.WriteLine($"{A}\n{B}\n");

// Результат при обеих случаях одинаковый.