//Вывести на одной строке числа 7, 43, 17 с двумя пробелом между ними.

//Возможно проделать данную операцию на одной строке с помощью несложной конструкции со знаком $.
// System.Console.WriteLine($"{7}  {43}  {17}");

// //Возможен и такой способ.
int A = 7;
int B = 43;
int C = 17;

// //Какой способ лучше выбирать пользователю.
System.Console.Write($"{A}  {B}  {C}");

//То есть задача аналогичная предыдущей только с двумя пробелами.